Public Attributes | List of all members
API_CWPanelType Struct Reference
Element Manager API
Represents a Curtain Wall Panel element. More...
#include <APIdefs_Elements.h>
 Public Attributes
API_Elem_Head  | head
General element header.
short  | pen
For internal use only.
API_OverriddenAttribute  | outerSurfaceMaterial
Material override structure of the exterior surface of the panel.
API_OverriddenAttribute  | innerSurfaceMaterial
Material override structure of the interior surface of the panel.
API_OverriddenAttribute  | cutSurfaceMaterial
Material override structure of the edge surface of the panel.
API_AttributeIndex  | buildingMaterial
Building Material of the panel.
API_AttributeIndex  | cutLineType
Line index of the cut part of the panel on the floorplan.
short  | cutLinePen
Pen index of the cut part of the panel on the floorplan.
bool  | deleteFlag
Flags a panel class for deletion. In this case, the panel's className should be the name of the class to substitute it with.
bool  | defaultSubElem
Tells if this is the default panel for the curtain wall.
UInt32  | segmentID
Identifier of containing segment.
API_CWPanelObjectTypeID  | objectType
Type of the panel.
double  | thickness
Thickness of the panel.
API_Guid  | owner
The owner curtain wall of this panel.
API_Guid  | symbolID
The related library part's object identifier.
bool  | hasSymbol
True if the panel is a GDL object.
bool  | hidden
Deleted panels remain in the database.
Int32  | libInd
Library object index if the panel is a GDL object.
UInt32  | classID
Panel class identifier (previously known as category).
UInt32  | edgesNum
The number of neighbour frames.
UInt32  | gridPolyIDsNum
Reserved for internal use.
API_Coord3D  | centroid
The 3D coordinates of the panel's centroid.
GS::uchar_t  | className [256]
Name of the panel's class.
Detailed Description
Represents a Curtain Wall Panel element.
Remarks
The Curtain Wall is a hierarchical (system) element consisting of Frame, Panel, Accessory and Junction components: these are the Members of the Curtain Wall, arranged on a Base Surface according to a pre-defined scheme.
Member Data Documentation
◆ buildingMaterial
 API_CWPanelType::buildingMaterial
Building Material of the panel.
◆ centroid
 API_CWPanelType::centroid
The 3D coordinates of the panel's centroid.
◆ classID
 API_CWPanelType::classID
Panel class identifier (previously known as category).
◆ className
 API_CWPanelType::className
Name of the panel's class.
◆ cutLinePen
 API_CWPanelType::cutLinePen
Pen index of the cut part of the panel on the floorplan.
◆ cutLineType
 API_CWPanelType::cutLineType
Line index of the cut part of the panel on the floorplan.
◆ cutSurfaceMaterial
 API_CWPanelType::cutSurfaceMaterial
Material override structure of the edge surface of the panel.
◆ defaultSubElem
 API_CWPanelType::defaultSubElem
Tells if this is the default panel for the curtain wall.
◆ deleteFlag
 API_CWPanelType::deleteFlag
Flags a panel class for deletion. In this case, the panel's className should be the name of the class to substitute it with.
◆ edgesNum
 API_CWPanelType::edgesNum
The number of neighbour frames.
◆ gridPolyIDsNum
 API_CWPanelType::gridPolyIDsNum
Reserved for internal use.
◆ hasSymbol
 API_CWPanelType::hasSymbol
True if the panel is a GDL object.
◆ head
 API_CWPanelType::head
General element header.
◆ hidden
 API_CWPanelType::hidden
Deleted panels remain in the database.
◆ innerSurfaceMaterial
 API_CWPanelType::innerSurfaceMaterial
Material override structure of the interior surface of the panel.
◆ libInd
 API_CWPanelType::libInd
Library object index if the panel is a GDL object.
◆ objectType
 API_CWPanelType::objectType
Type of the panel.
◆ outerSurfaceMaterial
 API_CWPanelType::outerSurfaceMaterial
Material override structure of the exterior surface of the panel.
◆ owner
 API_CWPanelType::owner
The owner curtain wall of this panel.
◆ pen
 API_CWPanelType::pen
For internal use only.
◆ segmentID
 API_CWPanelType::segmentID
Identifier of containing segment.
◆ symbolID
 API_CWPanelType::symbolID
The related library part's object identifier.
◆ thickness
 API_CWPanelType::thickness
Thickness of the panel.